Revit 2026 API

# BuiltInFailuresSweptBlendFailures Class

---

Failures about SweptBlend.

SystemObject Autodesk.Revit.DBBuiltInFailuresSweptBlendFailures

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static class SweptBlendFailures
```
```vb
Public NotInheritable Class SweptBlendFailures
```
```cpp
public ref class SweptBlendFailures abstract sealed
```
```fsharp
[<AbstractClassAttribute>]
[<SealedAttribute>]
type SweptBlendFailures = class end
```

The BuiltInFailuresSweptBlendFailures type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | CannotDrawSweptblend | Can't create swept blend. |

#### Reference

Autodesk.Revit.DB Namespace